"""
Демонстрация работы библиотеки парсера BeautifulSoup на примере открытия файла с диска

Для работы необходима библиотека BeautifulSoup.
Команда для устанкови - "pip.exe install bs4"
"""
from bs4 import BeautifulSoup  # подключить библиотеку Парсера


# открыть файл в режиме чтения и с кодировкой utf-8
filePath = r'C:\Users\StudiEd-PC\YandexDisk\Mag AVTF1\ИС\Лабы\1_leguria.html'  # путь к файлу в формате относителього пути
file = open(filePath, 'r', encoding="utf-8")

# получить содержимое файла-страницы в виде html-кода
html_doc = file.read()

# произвести разбор html-кода на элементы. Переменная soup содержит специальную структуры данных с вложенеми элементами
soup = BeautifulSoup(html_doc, 'html.parser')

# Вывести отдельные элементы из объекта
print("\n# Код страницы ----------------------------------------------------------------------------------------------")
print(soup.prettify())

print("\n# Блок служебной информации----------------------------------------------------------------------------------")
print(soup.head)

print("\n# Заголовок -------------------------------------------------------------------------------------------------")
print(soup.title)
print(soup.title.text)

print("\n# Тест страницы ---------------------------------------------------------------------------------------------")
print(soup.text)

print("\n# Поиск элементов по тегу 'a' -------------------------------------------------------------------------------")
foundLinks = soup.find_all('a')
for link in foundLinks:
    print("href: {};  text= {}; html = {} ".format(link['href'], link.text, link) )

print("\n# -----------------------------------------------------------------------------------------------------------")






























file.close()